# **Exploratory Data Analysis (EDA) - Etablissements** #

In [1]:
import pandas as pd
import numpy as np

## **ETABLISSEMENTS** ##

CODGEO : ID géographique de la ville  
LIBGEO : nom de la ville  
REG : numéro de région  
DEP : numéro de département  
E14TST : nombre total d'entreprises dans la ville  
E14TS0ND : nombre d'entreprises de taille inconnue ou nulle dans la ville  
E14TS1 : nombre d'entreprises de 1 à 5 employés dans la ville  
E14TS6 : nombre d'entreprises de 6 à 9 employés dans la ville  
E14TS10 : nombre d'entreprises de 10 à 19 employés dans la ville  
E14TS20 : nombre d'entreprises de 20 à 49 employés dans la ville  
E14TS50 : nombre d'entreprises de 50 à 99 employés dans la ville  
E14TS100 :  nombre d'entreprises de 100 à 199 employés dans la ville  
E14TS200 : nombre d'entreprises de 200 à 499 employés dans la ville  
E14TS500 : nombre d'entreprises de plus de 500 employés dans la ville

### Création du dataframe ets ###

In [2]:
ets = pd.read_csv('./data/base_etablissement_par_tranche_effectif.csv')
ets.head()

,CODGEO,LIBGEO,REG,DEP,E14TST,E14TS0ND,E14TS1,E14TS6,E14TS10,E14TS20,E14TS50,E14TS100,E14TS200,E14TS500
0,01001,L'Abergement-Clémenciat,82,01,25,22,1,2,0,0,0,0,0,0
1,01002,L'Abergement-de-Varey,82,01,10,9,1,0,0,0,0,0,0,0
2,01004,Ambérieu-en-Bugey,82,01,996,577,272,63,46,24,9,3,2,0
3,01005,Ambérieux-en-Dombes,82,01,99,73,20,3,1,2,0,0,0,0
4,01006,Ambléon,82,01,4,4,0,0,0,0,0,0,0,0

### Combien de lignes ? ###

In [3]:
#Combien de lignes?
print('Nombre de lignes : {}'.format(len(ets)))

Nombre de lignes : 36681

### Des doublons ? ###

In [4]:
#Doublons?
ets.duplicated().value_counts()

False    36681
dtype: int64

### Création d'un dataframe ets_numbers pour exploration des valeurs numériques ###

In [5]:
ets_numbers = ets.select_dtypes(include='number')

#CODGEO, LIBGEO et DEP ne sont pas des colonnes à variables numériques
ets_numbers.head()

,REG,E14TST,E14TS0ND,E14TS1,E14TS6,E14TS10,E14TS20,E14TS50,E14TS100,E14TS200,E14TS500
0,82,25,22,1,2,0,0,0,0,0,0
1,82,10,9,1,0,0,0,0,0,0,0
2,82,996,577,272,63,46,24,9,3,2,0
3,82,99,73,20,3,1,2,0,0,0,0
4,82,4,4,0,0,0,0,0,0,0,0

In [6]:
#Toutes les colonnes numériques sont des integers
ets_numbers.dtypes

REG         int64
E14TST      int64
E14TS0ND    int64
E14TS1      int64
E14TS6      int64
E14TS10     int64
E14TS20     int64
E14TS50     int64
E14TS100    int64
E14TS200    int64
E14TS500    int64
dtype: object

In [7]:
#Des NaN dans ces colonnes numériques ? NON
ets_numbers.isna().sum()

REG         0
E14TST      0
E14TS0ND    0
E14TS1      0
E14TS6      0
E14TS10     0
E14TS20     0
E14TS50     0
E14TS100    0
E14TS200    0
E14TS500    0
dtype: int64

In [8]:
#pour les colonnes avec le nombre d'établissements, est-ce que les min et max sont cohérents?
for i in ets_numbers.columns[1:]:
  print('Colonne {} : min = {} / max = {}'.format(i, ets_numbers[i].min(), ets_numbers[i].max()))

Colonne E14TST : min = 0 / max = 427385
Colonne E14TS0ND : min = 0 / max = 316603
Colonne E14TS1 : min = 0 / max = 76368
Colonne E14TS6 : min = 0 / max = 14836
Colonne E14TS10 : min = 0 / max = 10829
Colonne E14TS20 : min = 0 / max = 5643
Colonne E14TS50 : min = 0 / max = 1658
Colonne E14TS100 : min = 0 / max = 812
Colonne E14TS200 : min = 0 / max = 456
Colonne E14TS500 : min = 0 / max = 180

In [9]:
#Quel est le poids de E14TS0ND (nombre d'entreprises de taille inconnue ou nulle dans la ville) dans le dataset?

#Nombre d'entreprises de taille inconnue ou nulle
E14TS0ND = ets.E14TS0ND.sum()
print('Nombre d\'entreprises de taille inconnue ou nulle : {}'.format(E14TS0ND))

ets_taille_connue = ets_numbers.drop(['REG', 'E14TS0ND', 'E14TST'], axis=1)

total_ets_avec_taille = 0
for i in ets_taille_connue.columns:
  total_ets_avec_taille += ets_taille_connue[i].sum()

print('Nombre d\'entreprises avec taille connue : {}'.format(total_ets_avec_taille))
print('Proportion d\'entreprises avec taille inconnue ou nulle : {}%'.format(np.round(E14TS0ND / (E14TS0ND + total_ets_avec_taille) * 100),1))
print('Nombre total d\'entreprises : {}'.format(E14TS0ND + total_ets_avec_taille))

Nombre d'entreprises de taille inconnue ou nulle : 3064892
Nombre d'entreprises avec taille connue : 1463600
Proportion d'entreprises avec taille inconnue ou nulle : 68.0%
Nombre total d'entreprises : 4528492

### Colonne REG (Régions) : Combien de valeurs uniques ? #

In [10]:
# Combien de valeurs uniques dans REG ?
print(len(np.unique(ets_numbers.REG)))

27

In [11]:
ets_numbers.REG.value_counts(dropna=False)

73    3020
82    2874
41    2338
72    2296
22    2291
26    2046
21    1953
24    1841
25    1812
43    1785
91    1545
31    1545
52    1496
54    1460
23    1420
83    1310
11    1281
53    1270
93     958
42     904
74     747
94     360
2       34
1       32
4       24
3       22
6       17
Name: REG, dtype: int64

### Colonne DEP : Des valeurs non numériques ? Le 0 des 9 premiers DEP conservé ? Combien de DEP ?

In [12]:
#Quelles sont les valeurs non numériques dans DEP ?
DEP_no_numbers = []

for i in ets.DEP:
  try:
    int(i)
  except:
    DEP_no_numbers.append(i)

#Départements de la Corse
print(np.unique(DEP_no_numbers))

['2A' '2B']

In [13]:
#Est-ce que les 0 sont bien présents dans les DPT 01,02,etc.? --> OUI
ets[ets.DEP.isin(['01','02','03','04','05','06','07','08','09','10'])].DEP.value_counts(dropna=False).sort_index()

01    419
02    816
03    320
04    200
05    172
06    163
07    339
08    463
09    332
10    433
Name: DEP, dtype: int64

In [14]:
#Combien de départements ?
print(len(np.unique(ets.DEP)))

101

### Création d'un dataframe pour l'exploration des objets (DEP excl.) ###

In [15]:
#Vérification des valeurs 'string' dans CODGEO et LIBGEO
#Création d'un dataframe pour ces deux colonnes
ets_string = ets.select_dtypes(include='object').drop(['DEP'], axis=1)
ets_string.head()

  CODGEO                   LIBGEO
0  01001  L'Abergement-Clémenciat
1  01002    L'Abergement-de-Varey
2  01004        Ambérieu-en-Bugey
3  01005      Ambérieux-en-Dombes
4  01006                  Ambléon

In [16]:
#est-ce qu'il y a des NaN ?
ets_string.isna().sum()

CODGEO    0
LIBGEO    0
dtype: int64

In [17]:
#Est-ce que chaque CODGEO est unique ?
print(len(np.unique(ets_string.CODGEO)) == len(ets_string))

True

In [18]:
#Dans LIBGEO ?
print(len(np.unique(ets_string.LIBGEO)) == len(ets_string))

False

### Colonne LIBGEO : Des valeurs non uniques ? ###

In [19]:
#Certains libellés LIBGEO sont identiques. Lesquels ?
count_libgeo = pd.DataFrame(ets_string.groupby(['LIBGEO']).size().reset_index().rename(columns={0: "count"})).sort_values(by='count', ascending=False)
count_libgeo.head(5)

               LIBGEO  count
28434  Sainte-Colombe     14
27969   Saint-Sauveur     12
2403         Beaulieu     11
28561    Sainte-Marie     11
15883          Le Pin     10

In [20]:
#Exemple de la diversité des CODGEO pour Sainte-Colombe
ets_string[ets_string['LIBGEO'] == 'Sainte-Colombe']

      CODGEO          LIBGEO
1879   05135  Sainte-Colombe
5779   16309  Sainte-Colombe
6198   17319  Sainte-Colombe
7472   21544  Sainte-Colombe
9311   25515  Sainte-Colombe
13301  33390  Sainte-Colombe
14059  35262  Sainte-Colombe
16007  40252  Sainte-Colombe
17782  46260  Sainte-Colombe
19147  50457  Sainte-Colombe
28585  69189  Sainte-Colombe
31345  76569  Sainte-Colombe
31919  77404  Sainte-Colombe
35807  89339  Sainte-Colombe

In [21]:
#est-ce qu'il y des caractère spéciaux?

spec_car = ['!', '?', "/", ',', ';']
spec_car_return = []
for i in ets_string.LIBGEO:
    for j in spec_car:
        if j in i:
            spec_car_return.append(j)

print(np.unique(spec_car_return))

[]

### Import d'une table INSEE sur les régions ###

In [22]:
#Les régions doivent elles rester des integers ? Vérification avec fichier INSEE des régions

reg = pd.read_csv("./Data_complement_insee/region_2022.csv")
reg.head()

   REG CHEFLIEU  TNCC         NCC      NCCENR     LIBELLE
0    1    97105     3  GUADELOUPE  Guadeloupe  Guadeloupe
1    2    97209     3  MARTINIQUE  Martinique  Martinique
2    3    97302     3      GUYANE      Guyane      Guyane
3    4    97411     0  LA REUNION  La Réunion  La Réunion
4    6    97608     0     MAYOTTE     Mayotte     Mayotte

In [23]:
reg.dtypes

REG          int64
CHEFLIEU    object
TNCC         int64
NCC         object
NCCENR      object
LIBELLE     object
dtype: object